/*
	데이터의 입력과 출력은 프로그램의 흐름을 뜻하는 것이다.
	입력: 프로그램을 중심으로 프로그램 안으로 데이터가 흘러 들어오는 것
	출력: 프로그램 밖으로 데이터가 흘러 나가는 것
	
	Stream: 운영체제에서 제공하는 소프트웨어적인 가상의 다리 (운영체제는 외부장치와 프로그램과의 데이터 송수신의 도구가 되는 스트림을 제공한다
	참고로 Chapter 24에서는 파일 기반의 데이터 입출력을 공부하게 되는데, 이 때는 실행중인 프로그램과 하드 디스크에 저장되어 있는 파일과의 연결을 위한 스트림 형성을
	우리가 직접 운영체제에게 요구하게 된다

	콘솔(일반적으로 키보드와 모니터를 뜻함) 입출력과 파일 입출력 사이에는 차이점이 있는데, 그것은
	파일과의 연결을 위한 스트림의 생성을 직접 요구하는가, 아닌가 이다.
	콘솔 입출력을 위한 '입력 스트림'과 '출력 스트림'은 프로그램이 실행되면 자동으로 생성되고, 프로그램이 종료되면 자동으로 소멸되는 시스템이다.

	스트림: 한 방향으로 흐르는 데이터의 흐름. 단 방향 데이터 전송이 이뤄진다는 뜻을 갖고 있다.
*/

#include<stdio.h>

int main() {

}